[
  {
    "id": "dmarc",
    "term": "DMARC",
    "category": "infra",
    "shortDefinition": "Politique email anti-usurpation basée sur SPF et DKIM.",
    "fullDefinition": "DMARC définit comment traiter les emails non alignés (none, quarantine, reject) et fournit des rapports pour piloter la protection du domaine.",
    "aliases": [
      "Domain-based Message Authentication, Reporting and Conformance"
    ],
    "related": [
      "phishing"
    ]
  },
  {
    "id": "edr",
    "term": "EDR",
    "category": "infra",
    "shortDefinition": "Détection et réponse sur endpoints.",
    "fullDefinition": "Un EDR collecte la télémétrie poste/serveur, détecte des comportements suspects et assiste l'investigation et la remédiation en temps réel.",
    "aliases": [
      "Endpoint Detection and Response"
    ],
    "related": [
      "xdr",
      "soc"
    ]
  },
  {
    "id": "ecdh",
    "term": "ECDH",
    "category": "infra",
    "shortDefinition": "Mécanisme d'échange de clé basé sur les courbes elliptiques.",
    "fullDefinition": "Elliptic Curve Diffie-Hellman permet à deux parties d'établir un secret partagé pour initialiser des sessions chiffrées. En transition post-quantique, il est souvent combiné à ML-KEM dans des schémas hybrides.",
    "aliases": [
      "Elliptic Curve Diffie-Hellman"
    ],
    "related": [
      "ecdsa",
      "rsa",
      "ml-kem",
      "tls"
    ]
  },
  {
    "id": "ecdsa",
    "term": "ECDSA",
    "category": "infra",
    "shortDefinition": "Schéma de signature numérique basé sur les courbes elliptiques.",
    "fullDefinition": "Elliptic Curve Digital Signature Algorithm est utilisé pour authentifier certificats et échanges signés. Dans les migrations PQC, il est progressivement complété par ML-DSA ou SLH-DSA.",
    "aliases": [
      "Elliptic Curve Digital Signature Algorithm"
    ],
    "related": [
      "ecdh",
      "rsa",
      "ml-dsa",
      "slh-dsa"
    ]
  },
  {
    "id": "hkdf",
    "term": "HKDF",
    "category": "infra",
    "shortDefinition": "Fonction de dérivation HMAC utilisée dans les schedules TLS 1.3.",
    "fullDefinition": "HKDF applique un schéma extract-then-expand pour dériver des clés robustes à partir d'un secret initial. Cette primitive est centrale dans TLS 1.3 et dans plusieurs constructions hybrides.",
    "aliases": [
      "HMAC-based Key Derivation Function"
    ],
    "related": [
      "kdf",
      "tls",
      "kem"
    ]
  },
  {
    "id": "hsm",
    "term": "HSM",
    "category": "infra",
    "shortDefinition": "Module matériel protégé pour stocker et utiliser des clés.",
    "fullDefinition": "Un Hardware Security Module exécute des opérations cryptographiques sensibles dans un environnement durci. Les capacités HSM déterminent souvent le rythme de modernisation d'une PKI et la migration post-quantique.",
    "aliases": [
      "Hardware Security Module"
    ],
    "related": [
      "pki",
      "ml-dsa",
      "slh-dsa"
    ]
  },
  {
    "id": "iam",
    "term": "IAM",
    "category": "infra",
    "shortDefinition": "Gestion des identités et des droits d'accès.",
    "fullDefinition": "IAM structure comptes, rôles, policies et fédération pour appliquer moindre privilège, traçabilité et contrôle fin des permissions.",
    "aliases": [
      "Identity and Access Management"
    ],
    "related": [
      "zero-trust",
      "mfa"
    ]
  },
  {
    "id": "mfa",
    "term": "MFA",
    "category": "infra",
    "shortDefinition": "Authentification avec plusieurs facteurs indépendants.",
    "fullDefinition": "La MFA combine au moins deux preuves (mot de passe, appareil, biométrie, clé physique) pour réduire le risque de compromission de compte.",
    "aliases": [
      "authentification multifacteur"
    ],
    "related": [
      "iam",
      "phishing"
    ]
  },
  {
    "id": "ml-dsa",
    "term": "ML-DSA",
    "category": "infra",
    "shortDefinition": "Standard NIST de signature numérique post-quantique basé sur réseaux.",
    "fullDefinition": "ML-DSA (FIPS 204) fournit un schéma de signature post-quantique orienté performances et déploiement opérationnel. Il est utilisé pour signer des certificats, artefacts logiciels et échanges nécessitant une authentification forte.",
    "aliases": [
      "FIPS 204",
      "Dilithium"
    ],
    "related": [
      "pqc",
      "ml-kem",
      "slh-dsa"
    ]
  },
  {
    "id": "ml-kem",
    "term": "ML-KEM",
    "category": "infra",
    "shortDefinition": "Standard NIST de KEM post-quantique pour établir des clés partagées.",
    "fullDefinition": "ML-KEM (FIPS 203) est un mécanisme d'encapsulation de clé basé sur les réseaux. Il est destiné à des usages comme TLS, VPN ou SSH pour l'établissement de clé résistant aux attaques quantiques.",
    "aliases": [
      "FIPS 203",
      "Kyber"
    ],
    "related": [
      "pqc",
      "ml-dsa",
      "tls"
    ]
  },
  {
    "id": "kdf",
    "term": "KDF",
    "category": "infra",
    "shortDefinition": "Fonction qui dérive des clés à partir d'un secret initial.",
    "fullDefinition": "Une Key Derivation Function transforme un secret partagé en plusieurs clés adaptées à des usages distincts. Elle est incontournable pour les protocoles modernes et les combinaisons cryptographiques hybrides.",
    "aliases": [
      "Key Derivation Function"
    ],
    "related": [
      "hkdf",
      "kem",
      "tls"
    ]
  },
  {
    "id": "kem",
    "term": "KEM",
    "category": "infra",
    "shortDefinition": "Mécanisme d'encapsulation de clé pour établir un secret partagé.",
    "fullDefinition": "Un Key Encapsulation Mechanism permet de construire un secret commun via encapsulation puis décapsulation. Il est essentiel dans les protocoles post-quantiques et dans les architectures de transition hybrides.",
    "aliases": [
      "Key Encapsulation Mechanism"
    ],
    "related": [
      "ml-kem",
      "kdf",
      "tls"
    ]
  },
  {
    "id": "pqc",
    "term": "PQC",
    "category": "infra",
    "shortDefinition": "Cryptographie conçue pour résister aux attaques d'ordinateurs quantiques.",
    "fullDefinition": "La cryptographie post-quantique remplace ou complète les algorithmes asymétriques vulnérables à Shor. En pratique, la transition passe souvent par des déploiements hybrides, puis une adoption progressive des standards normalisés.",
    "aliases": [
      "cryptographie post-quantique",
      "post-quantum cryptography"
    ],
    "related": [
      "ml-kem",
      "ml-dsa",
      "slh-dsa",
      "tls"
    ]
  },
  {
    "id": "pki",
    "term": "PKI",
    "category": "infra",
    "shortDefinition": "Infrastructure de gestion des certificats et des clés publiques.",
    "fullDefinition": "La Public Key Infrastructure gère émission, rotation, révocation et validation des certificats. Elle constitue un pivot technique pour déployer de nouvelles signatures et maintenir la confiance dans les systèmes distribués.",
    "aliases": [
      "Public Key Infrastructure"
    ],
    "related": [
      "hsm",
      "ml-dsa",
      "slh-dsa",
      "tls"
    ]
  },
  {
    "id": "rsa",
    "term": "RSA",
    "category": "infra",
    "shortDefinition": "Algorithme asymétrique historique pour chiffrement et signatures.",
    "fullDefinition": "RSA reste très déployé dans les systèmes hérités et certaines PKI. Son exposition théorique aux attaques quantiques en fait une cible prioritaire dans les plans de transition vers des mécanismes post-quantiques.",
    "aliases": [],
    "related": [
      "ecdh",
      "ecdsa",
      "pqc"
    ]
  },
  {
    "id": "sandboxing",
    "term": "Sandboxing",
    "category": "infra",
    "shortDefinition": "Isolation contrôlée pour limiter l’impact d’un code non fiable.",
    "fullDefinition": "Une sandbox limite permissions, système de fichiers, réseau et appels système pour contenir un comportement malveillant.",
    "aliases": [
      "bac à sable",
      "sandbox"
    ],
    "related": [
      "ai-agent",
      "zero-trust"
    ]
  },
  {
    "id": "siem",
    "term": "SIEM",
    "category": "infra",
    "shortDefinition": "Plateforme centralisant logs, corrélations et alertes sécurité.",
    "fullDefinition": "Le SIEM agrège les événements de multiples sources et applique des règles pour détecter des comportements anormaux.",
    "aliases": [
      "Security Information and Event Management"
    ],
    "related": [
      "soc",
      "ioc",
      "ttp"
    ]
  },
  {
    "id": "slh-dsa",
    "term": "SLH-DSA",
    "category": "infra",
    "shortDefinition": "Standard NIST de signature post-quantique basé sur fonctions de hachage.",
    "fullDefinition": "SLH-DSA (FIPS 205) est un schéma de signature stateless basé sur le hachage. Il apporte une alternative à ML-DSA avec des hypothèses différentes, utile pour diversifier les choix cryptographiques.",
    "aliases": [
      "FIPS 205",
      "SPHINCS+"
    ],
    "related": [
      "pqc",
      "ml-dsa"
    ]
  },
  {
    "id": "soc",
    "term": "SOC",
    "category": "infra",
    "shortDefinition": "Équipe opérationnelle de surveillance et réponse incidents.",
    "fullDefinition": "Le Security Operations Center supervise la détection, qualification, investigation et remédiation des incidents de sécurité.",
    "aliases": [
      "Security Operations Center"
    ],
    "related": [
      "siem",
      "ioc",
      "ttp"
    ]
  },
  {
    "id": "ssh",
    "term": "SSH",
    "category": "infra",
    "shortDefinition": "Protocole sécurisé pour accès distant, transfert et tunnels.",
    "fullDefinition": "Secure Shell protège les sessions d'administration et les transferts via chiffrement et authentification. Sa migration post-quantique dépend des extensions supportées par clients, serveurs et équipements intermédiaires.",
    "aliases": [
      "Secure Shell"
    ],
    "related": [
      "tls",
      "vpn",
      "pqc"
    ]
  },
  {
    "id": "tls",
    "term": "TLS",
    "category": "infra",
    "shortDefinition": "Protocole de chiffrement des communications réseau.",
    "fullDefinition": "Transport Layer Security protège la confidentialité et l'intégrité des flux (HTTPS, API, mail) via chiffrement, certificats et négociation cryptographique.",
    "aliases": [
      "Transport Layer Security"
    ],
    "related": [
      "zero-trust"
    ]
  },
  {
    "id": "vpn",
    "term": "VPN",
    "category": "infra",
    "shortDefinition": "Tunnel chiffré reliant des utilisateurs ou réseaux distants.",
    "fullDefinition": "Un Virtual Private Network sécurise les communications inter-sites ou nomades sur des réseaux non fiables. La compatibilité des suites cryptographiques et des appliances est un facteur clé de migration.",
    "aliases": [
      "Virtual Private Network"
    ],
    "related": [
      "tls",
      "ssh",
      "pqc"
    ]
  },
  {
    "id": "waf",
    "term": "WAF",
    "category": "infra",
    "shortDefinition": "Pare-feu applicatif web filtrant le trafic HTTP(S).",
    "fullDefinition": "Un WAF bloque ou limite des patterns d’attaque applicative (SQLi, XSS, bots), avec règles gérées ou personnalisées.",
    "aliases": [
      "Web Application Firewall"
    ],
    "related": [
      "zero-trust",
      "siem"
    ]
  },
  {
    "id": "xdr",
    "term": "XDR",
    "category": "infra",
    "shortDefinition": "Détection et réponse étendues sur plusieurs couches.",
    "fullDefinition": "Le XDR corrèle endpoints, réseau, email, cloud et identité pour accélérer la détection multi-source et la réponse coordonnée.",
    "aliases": [
      "Extended Detection and Response"
    ],
    "related": [
      "edr",
      "siem"
    ]
  },
  {
    "id": "zero-trust",
    "term": "Zero Trust",
    "category": "infra",
    "shortDefinition": "Principe: ne jamais faire confiance par défaut, toujours vérifier.",
    "fullDefinition": "Le modèle Zero Trust applique vérification continue, moindre privilège et segmentation forte, même dans le réseau interne.",
    "aliases": [
      "zéro confiance"
    ],
    "related": [
      "sandboxing",
      "soc"
    ]
  }
]
